_TESTE_FUNCIONAL_10032025-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario:  TESTE FUNCIONAL 10032025-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario:  TESTE FUNCIONAL 10032025-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
   TESTE FUNCIONAL 10032025-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1440,765)
      - go(https://blazedemo.com/)
      - waitForName(fromPort): "Clickable"
      - clickByName(fromPort)
      - waitForName(fromPort): "Clickable"
      - selectByName(fromPort): "Philadelphia"
      - waitForName(toPort): "Clickable"
      - clickByName(toPort)
      - waitForName(toPort): "Clickable"
      - selectByName(toPort): "Rome"
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)
      - 'waitForCSS(tr:nth-of-type(2) .btn)': "Clickable"
      - 'clickByCSS(tr:nth-of-type(2) .btn)'
      - waitForID(inputName): "Clickable"
      - clickByID(inputName)
      - waitForID(inputName): "Clickable"
      - typeByID(inputName): "naia"
      - waitForID(address): "Clickable"
      - clickByID(address)
      - waitForID(address): "Clickable"
      - typeByID(address): "123"
      - waitForID(city): "Clickable"
      - clickByID(city)
      - waitForID(city): "Clickable"
      - typeByID(city): "new york"
      - waitForID(state): "Clickable"
      - clickByID(state)
      - waitForID(state): "Clickable"
      - clickByID(state)
      - waitForID(state): "Clickable"
      - typeByID(state): "marrantam"
      - 'waitForCSS(div:nth-of-type(5) > .controls)': "Clickable"
      - 'clickByCSS(div:nth-of-type(5) > .controls)'
      - waitForID(zipCode): "Clickable"
      - clickByID(zipCode)
      - waitForID(zipCode): "Clickable"
      - typeByID(zipCode): "55"
      - waitForCSS(body): "Clickable"
      - clickByCSS(body)
      - waitForID(state): "Clickable"
      - typeByID(state): "new york"
      - waitForID(zipCode): "Clickable"
      - clickByID(zipCode)
      - waitForID(zipCode): "Clickable"
      - typeByID(zipCode): "5555"
      - waitForID(cardType): "Clickable"
      - clickByID(cardType)
      - waitForID(cardType): "Clickable"
      - selectByID(cardType): "American Express"
      - waitForID(creditCardNumber): "Clickable"
      - clickByID(creditCardNumber)
      - waitForID(creditCardNumber): "Clickable"
      - typeByID(creditCardNumber): "456789"
      - waitForID(creditCardYear): "Clickable"
      - clickByID(creditCardYear)
      - waitForID(creditCardYear): "Clickable"
      - typeByID(creditCardYear): "2020"
      - 'waitForCSS(div:nth-of-type(10))': "Clickable"
      - 'clickByCSS(div:nth-of-type(10))'
      - waitForID(creditCardYear): "Clickable"
      - clickByID(creditCardYear)
      - waitForID(creditCardYear): "Clickable"
      - typeByID(creditCardYear): "2028"
      - waitForID(nameOnCard): "Clickable"
      - clickByID(nameOnCard)
      - waitForID(nameOnCard): "Clickable"
      - typeByID(nameOnCard): "naia"
      - waitForID(rememberMe): "Clickable"
      - clickByID(rememberMe)
      - waitForID(rememberMe): "Clickable"
      - clickByID(rememberMe)
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)

   TESTE FUNCIONAL 10032025-Http:
    headers:
      sec-ch-ua: '"Chromium";v="134", "Not:A-Brand";v="24", "Google Chrome";v="134"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Content-Type: application/x-www-form-urlencoded
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/134.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      sec-ch-ua-arch: '"x86"'
      sec-ch-ua-platform-version: '"19.0.0"'
      sec-ch-ua-model: '""'
      sec-ch-ua-bitness: '"64"'
      sec-ch-ua-wow64: '?0'
      sec-ch-ua-full-version-list: >-
        "Chromium";v="134.0.6998.89", "Not:A-Brand";v="24.0.0.0", "Google
        Chrome";v="134.0.6998.89"
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/reserve.php
            method: POST
            label: https://blazedemo.com/reserve.php
            think-time: 0ms
            headers: {}
            body:
              fromPort: Philadelphia
              toPort: Rome
          - url: https://blazedemo.com/purchase.php
            method: POST
            label: https://blazedemo.com/purchase.php
            think-time: 3112ms
            headers: {}
            body:
              airline: United Airlines
              flight: '234'
              fromPort: Philadelphia
              price: '432.98'
              toPort: Rome
          - url: https://blazedemo.com/confirmation.php
            method: POST
            label: https://blazedemo.com/confirmation.php
            think-time: 62344ms
            headers: {}
            body:
              _token: ''
              address: '123'
              cardType: amex
              city: new york
              creditCardMonth: '11'
              creditCardNumber: '456789'
              creditCardYear: '2028'
              inputName: naia
              nameOnCard: naia
              state: new york
              zipCode: '5555'